ban_list = [
    361441344297631746,#ソビエトの巫女(害悪)
    617620900325621760,#いぶき(12歳)
    607459082873602059,#ネクストの偽物(荒らし)
    436873807706456064,#ネクスト(kerotori疑惑)
    623229676860604422,#のりはま(うるさい)
    632986166488203264,#のりはまのサブアカ(同上)
    563526924412911631,#くーるーの新アカ(13歳未満及び看板祭り荒らし)
    325215346887753730,#猫咲夜(嘘つき、うるさい)
    607210069951643659,#そらまめ(バグの拡散)
    560737543214202880,#HKにわとり(過去にいろいろやったらしい)
    453874448035086337,#kerotori(言わずもがな)
    631743125832073236,#同上
    555197617815027712,#kagery(いろはちゃんへの風評被害、差別的発言)
    556578386433277982,#迷惑なフランス人
]
