siritori_start = ["しりとり","霧雨魔理沙(きりさめまりさ)","多々良小傘(たたらこがさ)","リリカ・プリズムリバー"]

siritori_nn = ["ンジャメナ","ンゴロンゴロ","ンカイ","ンガミ湖","ンズワニ島","ンゼレコレ","ンスタ","ンスカ","ンジャジジャ島"]

omikuji = [
    "大吉！\n今日はいいことがあるでしょう。\nきっとたぶんおそらくひょっとすると",
        "中吉！\n今日は普段よりちょっといい日になるかもしれませんんね。\nもしかしたら",
        "中吉！\n今日は普段よりちょっといい日になるかもしれませんんね。\nもしかしたら",
        "中吉！\n今日は普段よりちょっといい日になるかもしれませんんね。\nもしかしたら",
        "小吉！\n普段通りの日常です。普通が一番。",
        "小吉！\n普段通りの日常です。普通が一番。",
        "小吉！\n普段通りの日常です。普通が一番。",
        "小吉！\n普段通りの日常です。普通が一番。",
        "小吉！\n普段通りの日常です。普通が一番。",
        "凶…\n気をつけて生活しましょう。そうすれば大丈夫ですたぶんきっとメイビー",
        "凶…\n気をつけて生活しましょう。そうすれば大丈夫ですたぶんきっとメイビー",
        "凶…\n気をつけて生活しましょう。そうすれば大丈夫ですたぶんきっとメイビー",
        "大凶…\n物忌みと言って会社や学校を休んでもいいでしょう。ただし何かあっても責任はとりません()"
]

speca = [
    "反魂蝶「n分咲き」",
    "「無双風神」",
    "紫奥義「弾幕結界」",
    "「風神様の神徳」",
    "「マウンテン・オブ・フェイス」",
    "「幻想風靡」",
    "滅罪「正直者の死」",
    "禁忌「フォーオブアカインド」",
    "魍魎「二重黒死蝶」",
    "恋符「マスタースパーク」",
    "氷符「アイシクルフォール」"
]

meigen = [
    "あんた一人で陣なのか",
    "斬れぬものなどあんまりない！",
    "美しく残酷にこの大地から往ね！",
    "そーなのかー",
    "むきゅー",
    "コインいっこ",
    "2時間前に出直してきな",
    "くろまく～",
    "しゅ～ん",
    "大・正・解",
    "きゃん",
    "いぬにく～",
    "派手でなければ魔法じゃない。弾幕は火力だぜ。",
    "弾幕はブレイン。常識よ。",
    "弾幕はパワーだよ",
    "弾幕はパワーだよ",
    "弾幕はパワーだよ",
    "さあ、さでずむ？",
    "大丈夫、生きている間は一緒にいますから",
    "動くと撃つ！間違えた。撃つと動くだ。今すぐ動く",
    "２時間前に出直してきな",
    "夢のような現実だわ！"
]

osusume_eshi = [
    "https://twitter.com/franruhika \nルヒカさん\n万人受けする絵柄(だと思う)。はずれがない(と思う)。",
]

osusume_youtuber = [
    "https://www.youtube.com/user/marasy8 \nまらしぃ\n凄いピアニスト",
]

osusume_movie = [
    "未実装です。これやるのクソ面倒くさいんだ・・・"
]

name_kouho = [
    "あ","い","う","え","お","か","き","く","け","こ","さ","し","す","せ","そ",\
    "た","ち","つ","て","と","な","に","ぬ","ね","の","は","ひ","ふ","へ","ほ",\
    "ま","み","む","め","も","や","ゆ","よ","ら","り","る","れ","ろ","わ","ゐ","ゑ","を","ん",\
    "が","ぎ","ぐ","げ","ご","ざ","じ","ず","ぜ","ぞ","だ","ぢ","づ","で","ど",\
    "ば","び","ぶ","べ","ぼ","ぱ","ぴ","ぷ","ぺ","ぽ"
]

citycodes = {
    "稚内": '011000',
    "旭川": '012010',
    "網走": '013010',
    "根室": '014010',
    "釧路": '014020',
    "室蘭": '015010',
    "札幌": '016010',
    "函館": '017010',
    "青森": '020010',
    "八戸": '020030',
    "盛岡": '030010',
    "仙台": '040010',
    "秋田": '050010',
    "山形": '060010',
    "米沢": '060020',
    "酒田": '060030',
    "新庄": '060040',
    "福島": '070010',
    "若松": '070030',
    "水戸": '080010',
    "宇都宮": '090010',
    "前橋": '100010',
    "みなかみ": '100020',
    "さいたま": '110010',
    "秩父": '110030',
    "熊谷": '110020',
    "千葉": '120010',
    "銚子": '120020',
    "館山": '120030',
    "東京": '130010',
    "横浜": '140010',
    "新潟": '150010',
    "長岡": '150020',
    "富山": '160010',
    "金沢": '170010',
    "福井": '180010',
    "敦賀": '180020',
    "甲府": '190010',
    "長野": '200010',
    "松本": '200020',
    "岐阜": '210010',
    "高山": '210020',
    "静岡": '220010',
    "浜松": '220040',
    "名古屋": '230010',
    "豊橋": '230020',
    "津": '240010',
    "大津": '250010',
    "京都": '260010',
    "舞鶴": '260020',
    "大阪": '270000',
    "神戸": '280010',
    "奈良": '290010',
    "和歌山": '300010',
    "潮岬": '300020',
    "鳥取": '310010',
    "米子": '310020',
    "松江": '320010',
    "岡山": '330010',
    "広島": '340010',
    "下関": '350010',
    "山口": '350020',
    "萩": '350040',
    "徳島": '360010',
    "高松": '370000',
    "松山": '380010',
    "宇和島": '380030',
    "高知": '390010',
    "室戸岬": '390020',
    "福岡": '400010',
    "久留米": '400040',
    "佐賀": '410010',
    "長崎": '420010',
    "熊本": '430010',
    "人吉": '430040',
    "大分": '440010',
    "佐伯": '440040',
    "宮崎": '450010',
    "延岡": '450020',
    "都城": '450030',
    "鹿児島": '460010',
    "種子島": '460030',
    "那覇": '471010',
    "南大東": '472000',
    "宮古島": '473000',
    "石垣島": '474010',
    "与那国島": '474020'
}